Revit 2024 API
AnalyticalElement.AnalyzeAs Property
 This represents the Analyze As parameter assigned to Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public AnalyzeAs AnalyzeAs { get; set; }
Visual Basic
Public Property AnalyzeAs As AnalyzeAs
	Get
	Set
Visual C++
public:
property AnalyzeAs AnalyzeAs {
	AnalyzeAs get ();
	void set (AnalyzeAs value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The provided AnalyzeAs is not supported
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace